{
  "source_blog": "2026-02-19-k-shaped-recovery.md",
  "created": "2026-02-19T11:47:00",
  "scripts": [
    {
      "type": "60_second",
      "title": "Why Your Coworker Bought a House and You Can't",
      "hook": "You both kept your jobs. So why can they buy a house and you can't?",
      "segments": [
        {"time": "0-3s", "visual": "Jonathan looking directly at camera, slight head tilt, concerned expression", "audio": "You and your coworker. Same job. Same Harris Teeter. Same I-40 traffic."},
        {"time": "3-15s", "visual": "Cut to whiteboard, drawing a big letter K with marker", "audio": "But they just bought a house in Apex, and you're praying your lease renews. Here's why. It's called a K-shaped recovery."},
        {"time": "15-30s", "visual": "Split screen effect or hand gestures - top arm then bottom arm", "audio": "Upper arm: owns a home, works in tech, has investments. They're crushing it. Lower arm: renting, retail, hospitality, admin. Working just as hard, falling behind."},
        {"time": "30-45s", "visual": "Back to camera, more serious tone, holding calculator", "audio": "Raleigh unemployment is 3%. Sounds great. But being employed and being financially secure? Not the same thing anymore."},
        {"time": "45-60s", "visual": "Direct to camera, warm but urgent", "audio": "Here's what you do: build a 6-month safety net. Update your insurance. And max that 401k match. Link in bio for a free review."}
      ],
      "captions": "[0-3s] Same job. Different outcomes. | [3-15s] The K-Shaped Recovery | [15-30s] Two arms. Two realities. | [30-45s] 3% unemployment ≠ security | [45-60s] Protect what you have",
      "props_needed": ["whiteboard and marker", "calculator", "coffee mug (on desk)"],
      "filming_notes": "Film in home office with natural light. Use jump cut at 3s to whiteboard. Keep energy conversational, not doom-and-gloom. End with confident, helpful tone."
    },
    {
      "type": "90_second",
      "title": "I Wish I Knew This at 30: The K-Shaped Recovery",
      "hook": "Stop thinking the economy treats everyone the same. It doesn't.",
      "segments": [
        {"time": "0-3s", "visual": "Jonathan at desk, leaning forward slightly, direct eye contact", "audio": "I wish someone had explained this to me at 30."},
        {"time": "3-20s", "visual": "Standing at whiteboard, drawing K shape while talking", "audio": "The economy isn't one thing. It's a K. Two arms going in opposite directions. Same starting point, totally different endings. The upper arm? Homeowners before 2020. Tech workers. People with investments. They watched their net worth explode."},
        {"time": "20-40s", "visual": "Cut to sitting, holding coffee mug, more personal tone", "audio": "The lower arm? Renters paying 40% more than 2020. Hospitality, retail, admin workers. Fully employed, but their paycheck buys LESS now. Same economy. Completely different experience."},
        {"time": "40-60s", "visual": "Standing again, using hands for emphasis", "audio": "In the Triangle, RTP keeps growing. That's great if you already own property or work in biotech. But that growth drives up housing costs for everyone else. Raleigh's 3% unemployment sounds amazing—and it is—if you're in the right field."},
        {"time": "60-90s", "visual": "Back to desk, holding calculator, showing it to camera", "audio": "So what do you do? First, be honest about which arm you're on. Second, build that emergency fund—six months minimum. Third, protect your income with updated life and disability coverage. Don't let one diagnosis or job loss knock you off track. DM me 'SAFETY NET' and I'll send you my free checklist."}
      ],
      "captions": "[0-3s] I wish I knew this at 30... | [3-20s] The economy = a K shape | [20-40s] Two arms. Two stories. | [40-60s] Raleigh's 3% unemployment | [60-90s] Build your safety net",
      "props_needed": ["whiteboard and marker", "calculator", "coffee mug", "notebook with checklist visible"],
      "filming_notes": "Mix of standing (authority) and sitting (relatable) shots. Use whiteboard for visual anchor. Keep pacing brisk—this is the longer version so no dead air. Personal story angle makes it shareable. End with specific CTA that creates DM conversation."
    }
  ]
}
